app/views/parties/index.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ?  ORDER BY "customers"."id" ASC LIMIT 1  [["id", 1]]
---
      <div class="who">
     <strong> <%= party.customer.first_name + party.customer.last_name %> </strong>