app/views/customers/index.html.erb

SELECT  "residues".* FROM "residues" WHERE "residues"."restaurant_id" = ?  ORDER BY "residues"."id" ASC LIMIT 1  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "residues" WHERE "residues"."restaurant_id" = ?  [["restaurant_id", 1]]
---
	<h3><%= restaurant.restaurant_name %></h3>
	<% if restaurant.residues.count>0 %> Offering upto