app/views/restaurants/index.html.erb

<%= link_to "Create a leftover notification",new_residue_path %>
<% if current_restaurant.residues.count==0 %>
---
SELECT "residues".* FROM "residues" WHERE "residues"."restaurant_id" = ?  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "residues" WHERE "residues"."restaurant_id" = ?  [["restaurant_id", 1]]