app/controllers/parties_controller.rb

  def index
    @parties = Party.all
---
SELECT "parties".* FROM "parties"

  def create
    @party = Party.new(party_params)

    @party.customer_id = current_customer.id

    if @party.customer == current_customer

    respond_to do |format|
      if @party.save
---
INSERT INTO "parties" ("description", "food_amount", "date", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)