app/controllers/residues_controller.rb

  def index
    @residues = Residue.all
---
SELECT "residues".* FROM "residues"

  def create
    @residue = Residue.new(residue_params_without_time)
    @residue.restaurant_id=current_restaurant.id
    @residue.date=Time.now#.to_s.split(" ")[0]+" "+Time.now.to_s.split(" ")[1]
    if @residue.restaurant==current_restaurant
    respond_to do |format|
      if @residue.save
---
INSERT INTO "residues" ("description", "discount", "restaurant_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_residue
      @residue = Residue.find(params[:id])
---
SELECT  "residues".* FROM "residues" WHERE "residues"."id" = ? LIMIT 1  [["id", 1]]